app/views/seances/_form.html.erb

    <% if current_user.affilate.name == 'Admin' %>
      <%= f.select :doctor_id, Doctor.all.collect { |p| [p.full_name + ' — ' + p.affilate_name, p.id] }, {}, :class => 'form-control' %>
    <% else %>
      <%= f.select :doctor_id, Doctor.where('affilate_id = ?', current_user.affilate_id).collect { |p| [p.full_name, p.id] }, {}, :class => 'form-control' %>
---
SELECT "doctors".* FROM "doctors"
SELECT  "affilates".* FROM "affilates" WHERE "affilates"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    <%= f.label 'Пациент' %>
    <%= f.select :client_id, Client.all.collect { |p| [p.full_name, p.id] }, {:include_blank => 'Empty'}, :class => 'form-control' %>
---
SELECT "clients".* FROM "clients"