app/views/seances/generator.html.erb

SELECT "affilates".* FROM "affilates" WHERE (name != 'Admin')
---
        <label for="affilate_id">Филиал</label>
        <%= select_tag 'affilate_id', options_for_select( Affilate.where('name != ?', 'Admin').collect{ |u| [u.name, u.id] } ), :class => 'form-control' %>

SELECT "doctors".* FROM "doctors"
SELECT  "affilates".* FROM "affilates" WHERE "affilates"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
      <% if (current_user.affilate.name == 'Admin') %>
        <%= select_tag 'doctor', options_for_select(Doctor.all
        .collect{ |u| [u.full_name, u.id] }), :class => 'form-control' %>
      <% else %>
     	  <%= select_tag 'doctor', options_for_select(Doctor.where("affilate_id = ?", current_user.affilate_id)
     		.collect{ |u| [u.full_name, u.id] }), :class => 'form-control' %>