app/views/doctors/_form.html.erb

      <%= f.label 'Филиал' %>
      <%= f.select :affilate_id, Affilate.all.collect { |p| [p.name, p.id] }, {}, :class => 'form-control' %>
---
SELECT "affilates".* FROM "affilates"