app/views/app/new.html.erb

SELECT "affilates".* FROM "affilates" WHERE (name != 'Admin')
---
      <label for="doctor">Филиал</label>
      <%= select_tag 'affilate', options_for_select( Affilate.where('name != ?', 'Admin').collect{ |u| [u.name, u.id] } ), :class => 'form-control' %>