app/controllers/affilates_controller.rb

SELECT "affilates".* FROM "affilates" WHERE (name != 'Admin')
---
  def index
    @affilates = Affilate.where('name != ?', 'Admin')

INSERT INTO "affilates" ("address", "name", "created_at", "updated_at", "phone") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["address", "Адрес здесь написан"], ["name", "Фмлиал второй"], ["created_at", "2017-12-30 10:39:26.946769"], ["updated_at", "2017-12-30 10:39:26.946769"], ["phone", "432523"]]
---
  def create
    @affilate = Affilate.new(affilate_params)

    respond_to do |format|
      if @affilate.save

UPDATE "affilates" SET "address" = $1, "updated_at" = $2 WHERE "affilates"."id" = $3  [["address", "г. Москва, ул. Донская, д.43"], ["updated_at", "2017-12-17 18:29:55.076315"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @affilate.update(affilate_params)

DELETE FROM "affilates" WHERE "affilates"."id" = $1  [["id", 980190962]]
---
  def destroy
    @affilate.destroy

SELECT  "affilates".* FROM "affilates" WHERE "affilates"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
---
    def set_affilate
      @affilate = Affilate.find(params[:id])