app/controllers/app_controller.rb

SELECT  "seances".* FROM "seances" WHERE "seances"."id" = $1 LIMIT $2  [["id", 305], ["LIMIT", 1]]
---
  def show # отображение информации о записи
  	@seance = Seance.find(params[:seance_id])

SELECT "affilates".* FROM "affilates" WHERE (name != 'Admin')
SELECT "seances".* FROM "seances" WHERE (to_char(date, 'DD-MM-YYYY') = '' and doctor_id = 'Нет свободных врачей')
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
SELECT  "doctors".* FROM "doctors" WHERE "doctors"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def db # метод, выполняющий запросы к БД
  	case params[:to_find]
  	when "doctor"
  	  # находим все сеансы в выбранный день
  	  @result = Seance.where("to_char(date, 'DD-MM-YYYY') = ? and affilate_id = ?", params[:date], params[:affilate])
      # извлекаем только свободные сеансы
      @result = @result.select { |p| p.client.nil? }
  	  # извлекаем список врачей без повторов
  	  @result = @result.collect { |p| p.doctor }.uniq

SELECT "clients".* FROM "clients" WHERE (name = 'Кек' and last_name = 'Кеков' and phone = '53425435')
INSERT INTO "clients" ("created_at", "updated_at", "last_name", "name", "patronymic", "email", "phone", "birthdate", "is_moscow") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
SELECT  "seances".* FROM "seances" WHERE "seances"."id" = $1 LIMIT $2  [["id", 305], ["LIMIT", 1]]
UPDATE "seances" SET "client_id" = $1, "updated_at" = $2 WHERE "seances"."id" = $3  [["client_id", 12], ["updated_at", "2017-12-04 20:57:16.290939"], ["id", 305]]
---
  def add # метод, заполняющий поля БД
    # проверяем, зарегистрирован ли пациент в базе
    @client = Client.where("name = ? and last_name = ? and phone = ?", params[:name], params[:last_name], params[:phone])[0]
    if @client.nil? then
    	# создаём новую запись пациента в БД и заполнияем поля
    	@client = Client.new
    	@client.last_name = params[:last_name]
    	@client.name = params[:name]
    	@client.patronymic = params[:patronymic]
    	@client.birthdate = Date.strptime(params[:birthdate], '%d-%m-%Y')
    	@client.email = params[:email]
    	@client.phone = params[:phone]
    	@client.is_moscow = params[:is_moscow]
    	@client.save
    end
    # находим сеанс, на который производится запись и задаём пациента
    @seance = Seance.find(params[:seance])
    @seance.client = @client
    @seance.save