app/controllers/clients_controller.rb

  def show
    @seances = Seance.where('client_id = ?', @client.id)
---
SELECT "seances".* FROM "seances" WHERE (client_id = 12)

  def create
    @client = Client.new(client_params)

    respond_to do |format|
      if @client.save
---
INSERT INTO "clients" ("created_at", "updated_at", "last_name", "name", "patronymic") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2017-12-04 20:21:22.390746"], ["updated_at", "2017-12-04 20:21:22.390746"], ["last_name", "Васильев"], ["name", "Василий"], ["patronymic", "Васильевич"]]

  def destroy
    @seances = Seance.where("client_id = ?", @client.id)
    @seances.each do |s|
      s.client = nil
      s.save
    end
    @client.destroy
---
SELECT "seances".* FROM "seances" WHERE (client_id = 13)
UPDATE "seances" SET "client_id" = $1, "updated_at" = $2 WHERE "seances"."id" = $3  [["client_id", nil], ["updated_at", "2017-12-05 08:41:52.329354"], ["id", 306]]
DELETE FROM "clients" WHERE "clients"."id" = $1  [["id", 13]]