app/controllers/doctors_controller.rb

SELECT "doctors".* FROM "doctors"
SELECT  "affilates".* FROM "affilates" WHERE "affilates"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def index
    if (current_affilate = current_user.affilate).name == 'Admin'
      @doctors = Doctor.all
    else
      @doctors = Doctor.where("affilate_id = ?", current_affilate.id)

INSERT INTO "doctors" ("created_at", "updated_at", "last_name", "name", "patronymic", "rank", "affilate_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @doctor = Doctor.new(doctor_params)

    respond_to do |format|
      if @doctor.save

UPDATE "doctors" SET "last_name" = $1, "patronymic" = $2, "updated_at" = $3 WHERE "doctors"."id" = $4  [["last_name", "Узумаки"], ["patronymic", "Минатович"], ["updated_at", "2017-12-05 11:55:55.969073"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @doctor.update(doctor_params)

DELETE FROM "doctors" WHERE "doctors"."id" = $1  [["id", 4]]
---
  def destroy
    @doctor.destroy