app/controllers/feedbacks_controller.rb

SELECT "feedbacks".* FROM "feedbacks"
---
  def index
    @feedbacks = Feedback.all

SELECT  "feedbacks".* FROM "feedbacks" WHERE "feedbacks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_feedback
      @feedback = Feedback.find(params[:id])