app/controllers/seances_controller.rb

  def generate
    @affilate = (current_user.affilate.name == 'Admin') ? params[:affilate_id] : current_user.affilate_id
    # удаляем существующее расписание
    clear(params[:doctor], params[:date])
    # в переменной current будет храниться время, записываемое в данный момент
    # в переменной end будет храниться время, до которого будет выполняться цикл создания сеансов
    # записываем в current время начала приёма
    @current = params[:date] + '/' + params[:start_hour] + ':' + params[:start_minute]
    # .advance(hours: 3) — костыль для локализации времени, без него время смещается на 3 часа от нужного
    @current = Time.strptime(@current, '%d-%m-%Y/%H:%M') #.advance(hours: 3)
    # если есть перерыв, то в end записываем начало перерыва, иначе — конец приёма
    if params[:break] == '1'
      @end = params[:date] + '/' + params[:break_start_hour] + ':' + params[:break_start_minute]
      @end = Time.strptime(@end, '%d-%m-%Y/%H:%M') #.advance(hours: 3)
    else
      @end = params[:date] + '/' + params[:end_hour] + ':' + params[:end_minute]
      @end = Time.strptime(@end, '%d-%m-%Y/%H:%M') #.advance(hours: 3)
    end
    # length — длительность приёма
    @length = params[:length].to_i
    @doctor_id = params[:doctor].to_i
    # цикл, создающий сеансы во временном интервале от current до end
    while @current < @end
      @seance = Seance.new
      @seance.date = @current
      @seance.doctor_id = @doctor_id
      @seance.affilate_id = @affilate
      @seance.save
---
INSERT INTO "seances" ("created_at", "updated_at", "date", "doctor_id", "affilate_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2017-12-04 20:44:11.218962"], ["updated_at", "2017-12-04 20:44:11.218962"], ["date", "2017-12-08 10:00:00"], ["doctor_id", 2], ["affilate_id", 1]]

  def index
    @date = params[:date].blank? ? Time.now.strftime("%d-%m-%Y") : params[:date]
    # @seances = Seance.where("strftime('%d-%m-%Y', date) = ?", @date)
    if current_user.affilate.name == 'Admin'
      @seances = Seance.where("to_char(date, 'DD-MM-YYYY') = ?", @date).sort_by{ |s| [s.doctor.full_name, s.date] }
---
SELECT  "doctors".* FROM "doctors" WHERE "doctors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "seances".* FROM "seances" WHERE (to_char(date, 'DD-MM-YYYY') = '31-12-2017' and doctor_id = NULL)

  def create
    @seance = Seance.new(seance_params)

    respond_to do |format|
      if @seance.save
---
INSERT INTO "seances" ("created_at", "updated_at", "date", "doctor_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2017-12-17 18:15:55.974897"], ["updated_at", "2017-12-17 18:15:55.974897"], ["date", "2017-12-17 18:15:00"], ["doctor_id", 3]]

  def destroy
    @seance.destroy
---
DELETE FROM "seances" WHERE "seances"."id" = $1  [["id", 326]]

    def set_seance
      @seance = Seance.find(params[:id])
---
SELECT "seances".* FROM "seances" WHERE (to_char(date, 'DD-MM-YYYY') = '08-12-2017' and doctor_id = '2')